{
  "_name_or_path": "huggingface/CodeBERTa-small-v1",
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "DOTFILE",
    "1": "JavaScript",
    "2": "HTML",
    "3": "YAML",
    "4": "JSON",
    "5": "Markdown",
    "6": "Shell",
    "7": "Java",
    "8": "Text",
    "9": "C",
    "10": "Python",
    "11": "C++",
    "12": "Jupyter",
    "13": "Go",
    "14": "CSV",
    "15": "Ruby",
    "16": "PowerShell",
    "17": "Bash",
    "18": "Rust",
    "19": "TSV"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "DOTFILE": 0,
    "JavaScript": 1,
    "Python": 10,
    "C++": 11,
    "Jupyter": 12,
    "Go": 13,
    "CSV": 14,
    "Ruby": 15,
    "PowerShell": 16,
    "Bash": 17,
    "Rust": 18,
    "TSV": 19,
    "HTML": 2,
    "YAML": 3,
    "JSON": 4,
    "Markdown": 5,
    "Shell": 6,
    "Java": 7,
    "Text": 8,
    "C": 9
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 6,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.26.1",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 52000
}
